app/controllers/api/attributes_controller.rb

  def index
    attributes = Attribute.all

    @attributes = attributes.includes(:products)
---
SELECT "attributes".* FROM "attributes"
SELECT "attributes".* FROM "attributes" WHERE "attributes"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 1], ["id", 3]]

  def show
    @attribute = Attribute.find(params[:id])
---
SELECT  "attributes".* FROM "attributes" WHERE "attributes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]