app/controllers/api/products_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2, $3)  [["id", 1], ["id", 3], ["id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13)
---
  def index
    products = Product.all

    @products = products.includes(:details).includes(:reviews)