app/controllers/api/reviews_controller.rb

INSERT INTO "reviews" ("body", "rating", "product_id", "user_id", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["body", "test\n"], ["rating", 5], ["product_id", 1], ["user_id", 1], ["created_at", "2019-11-12 17:07:20.022948"], ["updated_at", "2019-11-12 17:07:20.022948"], ["username", "will"]]
---
  def create
    @review = current_user.reviews.new(review_params)

    @review.save