app/views/api/products/_product.json.jbuilder

SELECT "products"."id" FROM "products" INNER JOIN "product_attributes" ON "products"."id" = "product_attributes"."product_id" WHERE "product_attributes"."attribute_id" = $1  [["attribute_id", 1]]
---

json.productAttributes product.details#.pluck(:attribute_name, :attribute_value)