app/views/api/products/index.json.jbuilder

SELECT "attributes".* FROM "attributes"
SELECT "product_attributes".* FROM "product_attributes" WHERE "product_attributes"."attribute_id" IN ($1, $2, $3)  [["attribute_id", 1], ["attribute_id", 2], ["attribute_id", 3]]
SELECT "products"."id" FROM "products" INNER JOIN "product_attributes" ON "products"."id" = "product_attributes"."product_id" WHERE "product_attributes"."attribute_id" = $1  [["attribute_id", 1]]
---
  json.product_attributes do
    product.product_attributes.each do |attribute|

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---
  json.reviews do
    product.reviews.each do |review|