app/views/api/products/show.json.jbuilder

SELECT "product_attributes".* FROM "product_attributes" WHERE "product_attributes"."product_id" = $1  [["product_id", 1]]
---
json.product_attributes do
  @product.product_attributes.each do |attribute|